; ==============================================================================
; TRANSLITERATION, CYR-TO-FILENAMEENG =ru= ТРАНСЛИТЕРАЦИЯ, CYR-TO-FILENAMEENG
; ==============================================================================
; FileDescription: file name transliteration, CYR-TO-FILENAMEENG =ru= транслитерация имен файлов, CYR-TO-FILENAMEENG
; FileVersion: 2.0.3.0 2023-01-28 \\ (Major version).(Minor version).(Revision number).(Build number) (year)-(month)-(day)
; Author: kaiu@mail.ru \\ author of code changes 
; ProductName: Keybord_Assistant \\ included in the product
; OriginalFilename: Cyr-to-FileNameEng.ini \\ What file is this code from
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; IMPORTANT! Use UTF16 LE file format with BOM (Notepad++ can edit such a file https://notepad-plus-plus.org/) 
; =ru= ВАЖНО! Использовать формат файла UTF16 LE with BOM (редактировать такой файл умеет Notepad++ https://notepad-plus-plus.org/) 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; allowed to use character escaping \\ for \ (\r - 0x0D, \n - 0x0A, \t - 0x09, \e - =, \s - Space, \c - comma)
; =ru= можно использовать экранирование символов \\ для \ (\r - 0x0D, \n - 0x0A, \t - 0x09, \e - =, \s - Пробел, \c - запятая)
; each line in the [STRINGREPLACE] section can be retrieved (mandatory comma with 1 space):
; =ru= каждая строка в секции [STRINGREPLACE] может содержать команды (обязательно запятая с 1 пробелом):
; sr, SearchText, ReplaceText
; sr, SearchText, ReplaceText, all
;     where sr is short for StringReplace =ru= где sr сокращение от StringReplace

; loopsr, SearchText, ReplaceText 
;     where loopsr is short for loop{ StringReplace } for replacements like "--", "-"
;     =ru= где loopsr сокращение от loop{ StringReplace } для замен вида "--", "-"
    
; rr, NeedleRegEx, Replacement
;     where rr is short for RegExReplace https://www.autohotkey.com/docs/commands/RegExReplace.htm
;     =ru= где rr сокращение от RegExReplace 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
[STRINGREPLACE]
sr, а, a, All
sr, б, b, All
sr, в, v, All
sr, г, g, All
sr, д, d, All
sr, е, e, All
sr, ё, e, All
sr, ж, zh, All
sr, з, z, All
sr, и, i, All
sr, й, i, All
sr, к, k, All
sr, л, l, All
sr, м, m, All
sr, н, n, All
sr, о, o, All
sr, п, p, All
sr, р, r, All
sr, с, s, All
sr, т, t, All
sr, у, u, All
sr, ф, f, All
sr, х, kh, All
sr, ц, ts, All
sr, ч, ch, All
sr, ш, sh, All
sr, щ, shch, All
sr, ъ, ie, All
sr, ы, y, All
sr, ь, , All
sr, э, e, All
sr, ю, iu, All
sr, я, ia, All
;
sr, А, A, All
sr, Б, B, All
sr, В, V, All
sr, Г, G, All
sr, Д, D, All
sr, Е, E, All
sr, Ё, E, All
sr, Ж, Zh, All
sr, З, Z, All
sr, И, I, All
sr, Й, I, All
sr, К, K, All
sr, Л, L, All
sr, М, M, All
sr, Н, N, All
sr, О, O, All
sr, П, P, All
sr, Р, R, All
sr, С, S, All
sr, Т, T, All
sr, У, U, All
sr, Ф, F, All
sr, Х, Kh, All
sr, Ц, Ts, All
sr, Ч, Ch, All
sr, Ш, Sh, All
sr, Щ, Shch, All
sr, Ъ, Ie, All
sr, Ы, Y, All
sr, Ь, , All
sr, Э, E, All
sr, Ю, Iu, All
sr, Я, Ia, All
;
; replacement for some Ukrainian =ru= замена для некоторых украинских
sr, і, i, All
sr, І, I, All
sr, ї, ii, All
sr, Ї, Ii, All
sr, ґ, g, All
sr, Ґ, G, All
sr, є, ie, All
sr, Є, Ie, All
;
; other languages =ru= другие языки
sr, ў, w, All
sr, Ў, W, All
sr, ӂ, g, All
sr, Ӂ, G, All
;
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; replacement of space and other characters for saving in file names
; =ru= замена пробела и др. символов для сохранения в именах файлов
sr, №, N, All
sr, %, , All
sr, \c, , All
sr, :, , All
sr, ;, , All
sr, ", , All
sr, !, , All
sr, ?, , All
sr, ~, , All
sr, /, , All
sr, \\, , All
sr, *, , All
sr, >, , All
sr, <, , All
sr, |, , All
sr, @, , All
sr, |, , All
sr, +, , All
sr, ́, , All
; replacing minus and dash with hyphen =ru= замена минуса и тире на дефис
sr, −, -, All
sr, —, -, All
sr, –, -, All
; replacing different whitespace characters with a hyphen =ru= замена разных пробельных символов на дефис
sr,  , -, All
sr,  , -, All
sr,  , -, All
sr,  , -, All
sr, \s, -, All
;
loopsr, _, -
loopsr, --, -
; ==============================================================================